In [3]:
text1 = "More than ever, companies are able to tailor prices across people, places, and time. They do this to maximize profit, and sometimes simply to survive. We’re in a new era of supercharged price discrimination, made possible by two major scientific and technological trends. First, AI algorithms"

In [4]:
len(text1)

292

In [5]:
text2 = text1.split(" ")

In [7]:
len(text2)

46

In [11]:
[w for w in text2 if len(w) > 4]

['ever,',
 'companies',
 'tailor',
 'prices',
 'across',
 'people,',
 'places,',
 'time.',
 'maximize',
 'profit,',
 'sometimes',
 'simply',
 'survive.',
 'We’re',
 'supercharged',
 'price',
 'discrimination,',
 'possible',
 'major',
 'scientific',
 'technological',
 'trends.',
 'First,',
 'algorithms']

### Capitalized

In [13]:
[w for w in text2 if w.istitle()]

['More', 'They', 'First,']

In [14]:
[w for w in text2 if w.endswith("s")]

['companies', 'prices', 'across', 'this', 'sometimes', 'algorithms']

In [15]:
text3 = "To be or not to be"

In [16]:
text4 = text3.split(" ")

In [20]:
len(set(text4))

5

In [21]:
set(text4)

{'To', 'be', 'not', 'or', 'to'}

In [23]:
set([w.lower() for w in text4])

{'be', 'not', 'or', 'to'}

In [24]:
text5 = 'ouagadougou'

In [25]:
text6 = text5.split('ou')

In [26]:
text6

['', 'agad', 'g', '']

In [27]:
'ou'.join(text6)

'ouagadougou'

In [28]:
list(text5)

['o', 'u', 'a', 'g', 'a', 'd', 'o', 'u', 'g', 'o', 'u']

In [29]:
[c for c in text5]

['o', 'u', 'a', 'g', 'a', 'd', 'o', 'u', 'g', 'o', 'u']

In [30]:
text8 = '      A quick brown fox jumped over the lazy dog.  '

In [31]:
text8.split(' ')

['',
 '',
 '',
 '',
 '',
 '',
 'A',
 'quick',
 'brown',
 'fox',
 'jumped',
 'over',
 'the',
 'lazy',
 'dog.',
 '',
 '']

In [32]:
text9 = text8.strip()

In [34]:
text9.split(' ')

['A', 'quick', 'brown', 'fox', 'jumped', 'over', 'the', 'lazy', 'dog.']

In [36]:
text9

'A quick brown fox jumped over the lazy dog.'

In [35]:
text9.find('o')

10

In [37]:
text9.rfind('o')

40

In [38]:
text9.replace('o', 'O')

'A quick brOwn fOx jumped Over the lazy dOg.'

In [54]:
f = open('test.txt', 'r')

In [55]:
text14 = f.readline()

In [57]:
text14.rstrip()

'More than ever, companies are able to tailor prices across people, places, and time. They do this to maximize profit, and sometimes simply to survive. We’re in a new era of supercharged price discrimination, made possible by two major scientific and technological trends. First, AI algorithms — often trained on highly detailed behavioral data — enable organizations to infer what people are willing to pay with unprecedented precision. Second, recent developments in behavioral science — often invoked with the tagline “nudge” — provide organizations greater ability to influence their customers’ behaviors.'

In [41]:
f.readline()

'Not long ago, such tactics might have been taken in stride. But no longer. Today’s overlapping crises and changing attitudes highlight a truth that’s often been hidden in plain sight: Such supercharged pricing strategies can cause real harm to individuals, organizations, and societies.\xa0When companies deploy such strategies without considering their potential societal impacts, they risk harming people, inviting customer outcry and public outrage, and even reduced prospects for long-term survival.\n'

In [44]:
f.seek(0)

0

In [45]:
text12 = f.read()

In [47]:
len(text12)

13768

In [48]:
text13 = text12.splitlines()

In [50]:
len(text13)

36

In [51]:
text13[0]

'More than ever, companies are able to tailor prices across people, places, and time. They do this to maximize profit, and sometimes simply to survive. We’re in a new era of supercharged price discrimination, made possible by two major scientific and technological trends. First, AI algorithms — often trained on highly detailed behavioral data — enable organizations to infer what people are willing to pay with unprecedented precision. Second, recent developments in behavioral science — often invoked with the tagline “nudge” — provide organizations greater ability to influence their customers’ behaviors.'

In [52]:
text14 = f.readline()

In [53]:
text14

''

In [17]:
text15 = '"Ethics are built right into the ideals and objectives of the United Nations" \
#UNSG @ NY Society for Ethical Culture bit.ly/2guVelr  @dogahe @nltalk'

In [18]:
text16 = text15.split(' ')
text16

['"Ethics',
 'are',
 'built',
 'right',
 'into',
 'the',
 'ideals',
 'and',
 'objectives',
 'of',
 'the',
 'United',
 'Nations"',
 '#UNSG',
 '@',
 'NY',
 'Society',
 'for',
 'Ethical',
 'Culture',
 'bit.ly/2guVelr',
 '',
 '@dogahe',
 '@nltalk']

In [19]:
[w for w in text16 if w.startswith('#')]

['#UNSG']

In [20]:
[w for w in text16 if w.startswith('@')]

['@', '@dogahe', '@nltalk']

<br>

We can use regular expressions to help us with more complex parsing. 

For example `'@[A-Za-z0-9_]+'` will return all words that: 
* start with `'@'` and are followed by at least one: 
* capital letter (`'A-Z'`)
* lowercase letter (`'a-z'`) 
* number (`'0-9'`)
* or underscore (`'_'`)

In [22]:
import re # import re - a module that provides support for regular expressions

[w for w in text16 if re.search('@[A-Za-z0-9_]+', w)]

['@dogahe', '@nltalk']

In [23]:
[w for w in text16 if re.search('@\w+', w)]

['@dogahe', '@nltalk']

In [3]:
text16

['"Ethics',
 'are',
 'built',
 'right',
 'into',
 'the',
 'ideals',
 'and',
 'objectives',
 'of',
 'the',
 'United',
 'Nations"',
 '#UNSG',
 '@NY',
 'Society',
 'for',
 'Ethical',
 'Culture',
 'bit.ly/2guVelr']

In [13]:
tweet = "@nltk Text analysis is awesome! #regex #pandas #python @dogahe @ NY"

In [14]:
tweet_words = tweet.split(' ')

In [15]:
[w for w in tweet_words if w.startswith('#')]

['#regex', '#pandas', '#python']

In [16]:
[w for w in tweet_words if w.startswith('@')]

['@nltk', '@dogahe', '@']

In [25]:
text5

'ouagadougou'

In [29]:
re.findall('[aeiou]',text5)

['o', 'u', 'a', 'a', 'o', 'u', 'o', 'u']

In [31]:
re.findall('[^aeiou]',text5)

['g', 'd', 'g']

In [14]:
dateStr = "23-1-2002\n23/10/2002\n23/10/02\n10/23/2002\n23 Oct 2002\n23 October 2002\nOct 23, 2002\nOctober 23, 2002\n"

In [42]:
re.findall(r'\d{1,2}[/-]\d{1,2}[/-]\d{2,4}', dateStr)

['23-1-2002', '23/10/2002', '23/10/02', '10/23/2002']

In [52]:
re.findall(r'\d{2} (?:Jan|Feb|Oct)[a-z]* \d{4}', dateStr)

['23 Oct 2002', '23 October 2002']

In [15]:
re.findall(r'(?:\d{2} )?(?:Jan|Feb|Oct)[a-z]* (?:\d{2}, )?\d{4}', dateStr)

['23 Oct 2002', '23 October 2002', 'Oct 23, 2002', 'October 23, 2002']

# Working with Text Data in pandas

In [42]:
import pandas as pd

time_sentences = ["Monday: The doctor's appointment is at 2:45pm.", 
                  "Tuesday: The dentist's appointment is at 11:30 am.",
                  "Wednesday: At 7:00pm, there is a basketball game!",
                  "Thursday: Be back home by 11:15 pm at the latest.",
                  "Friday: Take the train at 08:10 am, arrive at 09:00am."]

df = pd.DataFrame(time_sentences, columns=['text'])
df

                                                text
0     Monday: The doctor's appointment is at 2:45pm.
1  Tuesday: The dentist's appointment is at 11:30...
2  Wednesday: At 7:00pm, there is a basketball game!
3  Thursday: Be back home by 11:15 pm at the latest.
4  Friday: Take the train at 08:10 am, arrive at ...

In [43]:
df['text'].str.len()

0    46
1    50
2    49
3    49
4    54
Name: text, dtype: int64

In [14]:
df['text'].str.split().str.len()

0     7
1     8
2     8
3    10
4    10
Name: text, dtype: int64

In [16]:
df['text'].str.contains('appointment')

0     True
1     True
2    False
3    False
4    False
Name: text, dtype: bool

In [35]:
df['text'].str.count(r'\d')

0    3
1    4
2    3
3    4
4    8
Name: text, dtype: int64

In [34]:
df['text'].str.findall(r'\d')

0                   [2, 4, 5]
1                [1, 1, 3, 0]
2                   [7, 0, 0]
3                [1, 1, 1, 5]
4    [0, 8, 1, 0, 0, 9, 0, 0]
Name: text, dtype: object

In [33]:
df['text'].str.findall(r'(\d?\d):(\d\d)')

0               [(2, 45)]
1              [(11, 30)]
2               [(7, 00)]
3              [(11, 15)]
4    [(08, 10), (09, 00)]
Name: text, dtype: object

In [45]:
df['text'].str.findall(r'\w+day\b')

0       [Monday]
1      [Tuesday]
2    [Wednesday]
3     [Thursday]
4       [Friday]
Name: text, dtype: object

In [46]:
df['text'].str.replace(r'\w+day\b', '???')

0          ???: The doctor's appointment is at 2:45pm.
1       ???: The dentist's appointment is at 11:30 am.
2          ???: At 7:00pm, there is a basketball game!
3         ???: Be back home by 11:15 pm at the latest.
4    ???: Take the train at 08:10 am, arrive at 09:...
Name: text, dtype: object

In [61]:
df['text'].str.replace(r'(\w+day\b)', lambda x: x.groups()[0][:3])

0          Mon: The doctor's appointment is at 2:45pm.
1       Tue: The dentist's appointment is at 11:30 am.
2          Wed: At 7:00pm, there is a basketball game!
3         Thu: Be back home by 11:15 pm at the latest.
4    Fri: Take the train at 08:10 am, arrive at 09:...
Name: text, dtype: object

In [62]:
df['text'].str.extract(r'(\d?\d):(\d\d)')

    0   1
0   2  45
1  11  30
2   7  00
3  11  15
4  08  10

In [63]:
df['text'].str.extractall(r'(\d?\d):(\d\d)')

          0   1
  match
0 0       2  45
1 0      11  30
2 0       7  00
3 0      11  15
4 0      08  10
  1      09  00

In [71]:
df['text'].str.extractall(r'((\d?\d):(\d\d) ?([ap]m))')

                0   1   2   3
  match
0 0        2:45pm   2  45  pm
1 0      11:30 am  11  30  am
2 0        7:00pm   7  00  pm
3 0      11:15 pm  11  15  pm
4 0      08:10 am  08  10  am
  1       09:00am  09  00  am

In [72]:
df['text'].str.extractall(r'(?P<time>(?P<hour>\d?\d):(?P<minute>\d\d) ?(?P<period>[ap]m))')

             time hour minute period
  match
0 0        2:45pm    2     45     pm
1 0      11:30 am   11     30     am
2 0        7:00pm    7     00     pm
3 0      11:15 pm   11     15     pm
4 0      08:10 am   08     10     am
  1       09:00am   09     00     am

In [18]:
original_tweet_text = "I luv my &lt;3 iphone &amp; you're awsm apple. DisplayIsAwesome, sooo happppppy 🙂 http://www.apple.com"

In [19]:
original_tweet_text

"I luv my &lt;3 iphone &amp; you're awsm apple. DisplayIsAwesome, sooo happppppy 🙂 http://www.apple.com"

In [20]:
tweet = original_tweet_text.encode('ascii','ignore')

In [21]:
APPOSTOPHES = {"'s" : " is", "'re" : " are"}

In [22]:
words = tweet.split()

In [23]:
reformed = [APPOSTOPHES[word] if word in APPOSTOPHES else word for word in words]

In [24]:
reformed

[b'I',
 b'luv',
 b'my',
 b'&lt;3',
 b'iphone',
 b'&amp;',
 b"you're",
 b'awsm',
 b'apple.',
 b'DisplayIsAwesome,',
 b'sooo',
 b'happppppy',
 b'http://www.apple.com']

# Assignment 1

In this assignment, you'll be working with messy medical data and using regex to extract relevant infromation from the data. 

Each line of the `dates.txt` file corresponds to a medical note. Each note has a date that needs to be extracted, but each date is encoded in one of many formats.

The goal of this assignment is to correctly identify all of the different date variants encoded in this dataset and to properly normalize and sort the dates. 

Here is a list of some of the variants you might encounter in this dataset:
* 04/20/2009; 04/20/09; 4/20/09; 4/3/09
* Mar-20-2009; Mar 20, 2009; March 20, 2009;  Mar. 20, 2009; Mar 20 2009;
* 20 Mar 2009; 20 March 2009; 20 Mar. 2009; 20 March, 2009
* Mar 20th, 2009; Mar 21st, 2009; Mar 22nd, 2009
* Feb 2009; Sep 2009; Oct 2010
* 6/2008; 12/2009
* 2009; 2010

Once you have extracted these date patterns from the text, the next step is to sort them in ascending chronological order accoring to the following rules:
* Assume all dates in xx/xx/xx format are mm/dd/yy
* Assume all dates where year is encoded in only two digits are years from the 1900's (e.g. 1/5/89 is January 5th, 1989)
* If the day is missing (e.g. 9/2009), assume it is the first day of the month (e.g. September 1, 2009).
* If the month is missing (e.g. 2010), assume it is the first of January of that year (e.g. January 1, 2010).
* Watch out for potential typos as this is a raw, real-life derived dataset.

With these rules in mind, find the correct date in each note and return a pandas Series in chronological order of the original Series' indices.

For example if the original series was this:

    0    1999
    1    2010
    2    1978
    3    2015
    4    1985

Your function should return this:

    0    2
    1    4
    2    0
    3    1
    4    3

Your score will be calculated using [Kendall's tau](https://en.wikipedia.org/wiki/Kendall_rank_correlation_coefficient), a correlation measure for ordinal data.

*This function should return a Series of length 500 and dtype int.*

In [1]:
import pandas as pd
import re

doc = []
with open('dates.txt') as file:
    for line in file:
        doc.append(line)

ndf = pd.Series(doc)
ndf.head(10)

0         03/25/93 Total time of visit (in minutes):\n
1                       6/18/85 Primary Care Doctor:\n
2    sshe plans to move as of 7/8/71 In-Home Servic...
3                7 on 9/27/75 Audit C Score Current:\n
4    2/6/96 sleep studyPain Treatment Pain Level (N...
5                    .Per 7/06/79 Movement D/O note:\n
6    4, 5/18/78 Patient's thoughts about current su...
7    10/24/89 CPT Code: 90801 - Psychiatric Diagnos...
8                         3/7/86 SOS-10 Total Score:\n
9             (4/10/71)Score-1Audit C Score Current:\n
dtype: object

In [2]:
import re

In [3]:
ex = ndf.str.extract(r'(\d{1,2}[/-]\d{1,2}[/-]\d{2,4})')

In [ ]:
re.findall(r'(?:\d{2} )?(?:Jan|Feb|Oct)[a-z]* (?:\d{2}, )?\d{4}', dateStr)

In [89]:
ex2 = ndf.str.extract(r'(\d{1,2}) (Jan|Feb|Mar|Apr|May|Jun|Jul|Aug|Sep|Oct|Nov|Dec)[a-z]*')

In [90]:
ex2[150:200]

       0    1
150   12  Mar
151   22  Jun
152   28  Sep
153   13  Jan
154   06  Mar
155   10  Oct
156   26  May
157   10  Feb
158   23  Aug
159   26  May
160   21  Oct
161   19  Oct
162   05  Mar
163   29  Jan
164   21  Oct
165   18  Aug
166   11  Nov
167   01  Oct
168   13  Oct
169   21  Oct
170   24  Jan
171   04  Oct
172   23  Aug
173   18  Oct
174   04  Dec
175   21  Oct
176   26  May
177   18  Jan
178   15  Jun
179   10  Dec
180   09  Dec
181   18  Aug
182   13  Jun
183   26  May
184   11  Nov
185   17  Aug
186   13  Oct
187   14  Jan
188   12  Mar
189   21  Oct
190   10  Aug
191   30  Nov
192   06  May
193   18  Jan
194  NaN  NaN
195  NaN  NaN
196  NaN  NaN
197  NaN  NaN
198  NaN  NaN
199  NaN  NaN

In [27]:
ndf[150:200]

150                  12 March 1980 SOS-10 Total Score:\n
151                      22 June 1990 Medical History:\n
152                   28 Sep 2015 Primary Care Doctor:\n
153                   13 Jan 1972 Primary Care Doctor:\n
154                   06 Mar 1974 Primary Care Doctor:\n
155                   10 Oct 1974 Primary Care Doctor:\n
156                   26 May 1974 Primary Care Doctor:\n
157    short term partial hospital program at Pine Re...
158                   23 Aug 2000 Primary Care Doctor:\n
159    .The patient brought himself to APS on 26 May ...
160    see 21 Oct 2007 Schroder Hospital discharge su...
161    19 Oct 2016 Communication with referring physi...
162                                    dON 05 Mar 1974\n
163                   29 Jan 1994 Primary Care Doctor:\n
164    see 21 Oct 1978 Schroder Hospital discharge su...
165    .On 18 August 1975 patient presented to BH ED/...
166    11 Nov 1996 CPT Code: 90792: With medical serv...
167                   01 Oct 1979 Primary Care Doctor:\n
168    .On 13 Oct 1986 patient admitted to Schroder H...
169    see 21 Oct 1995 Schroder Hospital discharge su...
170    44 y/o MWF, unemployed Decorator, living with ...
171      04 Oct 1972 Total time of visit (in minutes):\n
172    .On 23 Aug 1993 at return office visit Dr. Fis...
173                                   18 Oct 2006 Age:\n
174    .On 04 Dec 1988 the patient was admitted to Fa...
175    .On 21 Oct 1983 patient was discharged from Sc...
176    see above and APS eval of 26 May 2010 Educatio...
177    22 year old single Caucasian/Latino woman, une...
178    15 Jun 1985 @ 11 AMCommunication with referrin...
179    .On 10 Dec 1982, the first night after hospita...
180    .On 09 Dec 1988 the patient was discharged hom...
181                18 August 1995 Primary Care Doctor:\n
182    eby 13 June 1974 it appears amitriptyline had ...
183    see above and APS eval of 26 May 2008 Financia...
184                    11 Nov 2002 SOS-10 Total Score:\n
185    see 17 Aug 1985 eval by Dr. Ngo.Social History...
186                   13 Oct 2016 Primary Care Doctor:\n
187      14 Jan 2008 Total time of visit (in minutes):\n
188    12 March 2004 CPT Code: 90801 - Psychiatric Di...
189    ssee 21 Oct 1977 Schroder Hospital discharge s...
190    .By 10 Aug 2000 patient was rehospitalized at ...
191                    30 Nov 1972 SOS-10 Total Score:\n
192    06 May 1993 CPT Code: 90792: With medical serv...
193    s 22 year old single Caucasian/Latino woman, u...
194    April 11, 1990 CPT Code: 90791: No medical ser...
195    MRI May 30, 2001 empty sella but no problems w...
196    .Feb 18, 1994: made a phone call to Mom and Mo...
197    Brother died February 18, 1981 Parental/Caregi...
198    none; but currently has appt with new HJH PCP ...
199    .Came back to US on Jan 24 1986, saw Dr. Quack...
dtype: object